Autodesk.Revit.DB.Document.Export(System.String,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.PDFExportOptions)
Exports a selection of views in PDF format.
folder:
Output folder, into which file(s) will be exported. The folder must exist.
viewIds:
Selection of ordered views to be exported.
The list must contain at least one valid view.
options:
Various options applicable to the PDF format.
Returns:
True if all specified views are exported successfully,
False if exporting of any view fails, even if some views might have been exported successfully.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
There comes duplicated views in viewIds
-or-
some of the views are not printable (exportable).
-or-
Thrown when one or more input arguments are null.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileAccessException:
Thrown when the target PDF file is inaccessible, e.g. already opened.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Since:
2021.1

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.ATFSATExportOptions)
Exports the document to the ATF SAT format.
folder:
Output folder into which the file will be exported. The folder must exist.
name:
Indicates the name of the SAT file to export. If it doesn't end with ".sat", this extension will be added automatically.
The name cannot contain any of the following characters: \/:*?"<>|. Empty name is not acceptable.
options:
Various options applicable to the SAT format.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters
-or-
The viewId in provided export options is not an id of a 3D view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeExporter functionality is not available in the installed Revit.

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.ATFXMLExportOptions)
Exports the document to the ATF XML format.
folder:
Output folder into which the file will be exported. The folder must exist.
name:
Indicates the name of the ATFXML file to export. If it doesn't end with ".atfx", this extension will be added automatically.
The name cannot contain any of the following characters: \/:*?"<>|. Empty name is not acceptable.
options:
Various options applicable to the ATF XML format.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters
-or-
The viewId in provided export options is not an id of a 3D view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeExporter functionality is not available in the installed Revit.

Autodesk.Revit.DB.Document.SaveAsCloudModelInternal(System.String,System.String,System.String,System.String,System.String,System.String)
Internal process for previously nonworkshared files.
hubId:
Identifies the hub region to which this model would be saved.
region:
Identifies the hub region.
projectId:
Identifies the cloud project to which this model will be attached.
projectName:
The project name of this model.
folderId:
The folder ID input from Forge DM
modelName:
The name by which the model will be identified in A360.
Returns:
ModelPath of the saved model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralModelException:
Could be for any of the reasons that SynchronizeWithCentral fails with CentralModelException, for example, a central model with that name
is already associate to the specified A360 project.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Since:
2020

Autodesk.Revit.DB.Document.SaveAsCloudSharedModelCommon(System.String,System.Guid,System.String,System.String,System.Boolean)
Common process for both previously workshared and not previously workshared central files.
region:
Identifies the hub region to which this model would be saved.
projectGUID:
Identifies the cloud project to which this model will be attached.
modelName:
The name by which the model will be identified in A360.
folderId:
The folder ID input from Forge DM
bCreatedLocal:
If true, this will create a local copy of the model.
Returns:
ModelPath of the saved model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralModelException:
Could be for any of the reasons that SynchronizeWithCentral fails with CentralModelException, for example, a central model with that name
is already associate to the specified A360 project.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.

Autodesk.Revit.DB.Document.IsValidNameForCloudSharedModel(System.String,System.Guid,System.String)
Checks whether there is already a model with the specified name attached to the specified A360 project.
region:
Identifies the account region
projectGUID:
Identifies the A360 project to which this model will be attached.
modelName:
The name by which the model will be identified in A360.
Returns:
True if there is not already a model with the specified name attached to the specified project.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Document.EraseSchemaAndAllEntities(Autodesk.Revit.DB.ExtensibleStorage.Schema)
Erases Schema and all its Entities from the document.
Remarks:
The Schema remains in memory.
schema:
The Schema to erase.
Throws Autodesk.Revit.Exceptions.ArgumentException:
No write access to this Schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2021

Autodesk.Revit.DB.Document.ResetSharedCoordinates
Reset shared coordinates for the host model/file.
Remarks:
When you reset shared coordinates, the shared coordinates of the host model will be erased.
The shared relationship with all the linked models will be eliminated.
Survey point will be reset back to startup location, where it coincides with the Internal Origin.
The rotation angle between Project North and True North will be reset back to 0.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a primary document, it is a linked document.
-or-
This Document is not a project document.
-or-
This Document has is in an edit mode or is in family mode.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2021.1

Autodesk.Revit.DB.Document.Link(System.String,Autodesk.Revit.DB.DWFImportOptions)
Links Markups in a DWF file into the project document.
Remarks:
Link isn't supported for family documents.  Please use import instead.
file:
Full path of the file to link. File must exist and must be a valid DWF file.
options:
Various link options applicable to the DWF format.
Returns:
A collection of link instance element ids created by the markup link.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for DWF import (.dwf or.dwfx files are valid).
-or-
Some of the views is not importable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2014

Autodesk.Revit.DB.Document.Link(System.String,Autodesk.Revit.DB.DGNImportOptions,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId@)
Links a DGN file into the project document.
Remarks:
Link isn't supported for family documents.  Please use import instead.
file:
Full path of the file to link. File must exist and must be a valid DGN file.
options:
Various import options applicable to the DGN format. If null, all options will be set to their respective default values.
pDBView:
The view into which the file will be linked.
elementId:
The id of linked instance after a successful link.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for DGN import (.dgn files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
-or-
Empty DGN model view name characters
-or-
Visible layer only option must be set to false for DGN import
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The DGN Import/Link module is not available in the installed Revit.
Since:
2013

Autodesk.Revit.DB.Document.Link(System.String,Autodesk.Revit.DB.SKPImportOptions,Autodesk.Revit.DB.View)
Links an SKP file into the project document.
Remarks:
Link isn't supported for family documents.  Please use import instead.
file:
Full path of the file to link. File must exist and must be a valid SKP file.
options:
Various import options applicable to the SKP format. If null, all options will be set to their respective default values.
pDBView:
The view into which the file will be linked.
Returns:
Returns the element Id of the linked instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for SKP import (.skp file is valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The SKP Import/Link module is not available in the installed Revit.
Since:
2014

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.SKPImportOptions,Autodesk.Revit.DB.View)
Imports an SKP file into the document.
file:
Full path of the file to link. File must exist and must be a valid SKP file.
options:
Various import options applicable to the SKP format. If null, all options will be set to their respective default values.
pDBView:
The view into which the file will be linked.
Returns:
Returns the element Id of the linked instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for SKP import (.skp file is valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The SKP Import/Link module is not available in the installed Revit.
Since:
2014

Autodesk.Revit.DB.Document.Link(System.String,Autodesk.Revit.DB.SATImportOptions,Autodesk.Revit.DB.View)
Links an SAT file into the project document.
Remarks:
Link isn't supported for family documents.  Please use import instead.
file:
Full path of the file to link. File must exist and must be a valid SAT file.
options:
Various import options applicable to the SAT format. If null, all options will be set to their respective default values.
pDBView:
The view into which the file will be linked.
Returns:
Returns the element Id of the linked instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for SAT import (.sat file is valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The SAT Import/Link module is not available in the installed Revit.
Since:
2014

Autodesk.Revit.DB.Document.Link(System.String,Autodesk.Revit.DB.DWGImportOptions,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId@)
Links a DWG or DXF file into the project document.
Remarks:
Link isn't supported for family documents.  Please use import instead.
file:
Full path of the file to link. File must exist and must be a valid DWG or DXF file.
options:
Various import options applicable to the DWG or DXF format. If null, all options will be set to their respective default values.
pDBView:
The view into which the file will be linked.
elementId:
The id of linked instance after a successful link.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for DWG import (.dwg and .dxf files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The array of line weights is not valid; either it contains less than expected 255 values, or one or more values are out of range 1 to 16
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The DWG Import/Link module is not available in the installed Revit.

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.STLExportOptions)
Exports the document to the STL format.
folder:
Output folder into which the file will be exported. The folder must exist.
name:
Indicates the name of the STL file to export. If it doesn't end with ".stl", this extension will be added automatically.
The name cannot contain any of the following characters: \/:*?"<>|. Empty name is not acceptable.
options:
Various options applicable to the STL format.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters
-or-
The viewId in provided export options is not an id of a 3D view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeExporter functionality is not available in the installed Revit.
Since:
2021.1

Autodesk.Revit.DB.Document.SaveAsCloudModel(System.Guid,System.Guid,System.String,System.String)
Saves current nonworkshared model as a cloud model in BIM 360.
Remarks:
Assumes that user is currently signed in BIM 360 and has access to Autodesk cloud services.
This operation will create a model on cloud and then create a local cache of the cloud model.
This method cannot be used when current document is already in cloud.
accountId:
The BIM 360 account Id.
You can use one of the following methods to get this Id:
If you get the hub Id with Forge Data Management API, remove the prefix "b." of the Id string and convert the rest to a Guid.  If you get the account Id with Forge BIM 360 API, just convert the Id string to a Guid.
projectId:
The BIM 360 project Id.
You can use one of the following methods to get this Id:
If you get the project Id with Forge Data Management API, remove the prefix "b." of the Id string and convert the rest to a Guid.  If you get the project Id with Forge BIM 360 API, just convert the Id string to a Guid.
folderId:
Folder identity in BIM 360 to save the model.
You can use one of the following methods to get this Id:
The folder Id string from Forge Data Management API.  The folder Id string from Forge BIM 360 API.
modelName:
Model name in BIM 360 to save the model.
Throws Autodesk.Revit.Exceptions.ArgumentException:
folderId is an empty string.
-or-
modelName is an empty string.
-or-
modelName cannot include prohibited characters.
-or-
Thrown when the input BIM 360 account Id or project Id is invalid or unmatched.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
SaveAs may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document does not allow worksharing to be enabled.
-or-
This Document is a workshared document.
-or-
Saving is not allowed in the current application mode.
-or-
This Document has is in an edit mode or is in family mode.
-or-
This Document is not a primary document, it is a linked document.
-or-
SaveAs is temporarily disabled.
-or-
This Document is cloud model, cannot be saved as cloud model.
-or-
There is a transaction phase left open (such as a transaction, sub-transaction of transaction group) at the time of invoking this method.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
Could be for any of the reasons related to network.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
Failed due to there is a model in cloud under the project with that name.
-or-
Could be for any of the reasons that saveAs fails with RevitServerInternalException.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified cloud project.
Throws Autodesk::Revit::Exceptions::RevitServerUnauthorizedNativeException:
You do not have cloud model entitlement to access this resource in cloud
Throws Autodesk::Revit::Exceptions::UnauthenticatedUserException:
User is not authenticated to access the specified cloud project.
Since:
2021